#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_route53_zone.ga_dev_zone: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0a150328d4a36cd79][0m
[0m[1maws_route53_zone.ga_zone: Refreshing state... [id=Z056957931UA8C0ZEYSRV][0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1maws_acm_certificate.ga_certificate: Refreshing state... [id=arn:aws:acm:ca-central-1:654654488989:certificate/d132e5b7-a968-4e3b-aa29-3967eb6540aa][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-026b3100fac5bed9e][0m
[0m[1maws_ecs_cluster.ga_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:654654488989:cluster/ga-cluster-issue-7][0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-0f83db7ad4345a260][0m
[0m[1maws_alb_target_group.ga_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:targetgroup/ga-issue-7-tg/580c079f302f9d50][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-08d7c28ee8c4c75ab][0m
[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Read complete after 1s [id=Z10207542GS9DRXRUX91S][0m
[0m[1maws_ecs_cluster_capacity_providers.ga_cluster_capacity_providers: Refreshing state... [id=ga-cluster-issue-7][0m
[0m[1maws_route53_record.ga_record_ns: Refreshing state... [id=Z10207542GS9DRXRUX91S_issue-7.ga-dev.bac-lac.ca_NS][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-2305692576][0m
[0m[1mdata.aws_subnets.data: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-7-subnet-group][0m
[0m[1mdata.aws_subnets.app: Read complete after 1s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.web: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver1: Refreshing state... [id=fsap-0360c823309cf0470][0m
[0m[1maws_efs_access_point.ga_ap_upgrader1: Refreshing state... [id=fsap-08eab5d665ff72e45][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0948d3afd3205ef93][0m
[0m[1maws_efs_access_point.ga_ap_userdata: Refreshing state... [id=fsap-0e00b128b22042290][0m
[0m[1maws_efs_access_point.ga_ap_config1: Refreshing state... [id=fsap-06070ee746705414f][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-03ddffacd903ee941][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver2: Refreshing state... [id=fsap-08f69a04a9e50e36b][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-0bfce07b2eb7a8cfb][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot1: Refreshing state... [id=fsap-01a13ba86f96590e9][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot2: Refreshing state... [id=fsap-0e10ad036b290d4b1][0m
[0m[1maws_efs_access_point.ga_ap_config2: Refreshing state... [id=fsap-0dc616195c7bd8877][0m
[0m[1maws_efs_access_point.ga_ap_sharedconfig: Refreshing state... [id=fsap-05292a8e4dfc4be54][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog1: Refreshing state... [id=fsap-05a4c3a52bbdc9547][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog2: Refreshing state... [id=fsap-0ae76db52e67657d6][0m
[0m[1maws_efs_access_point.ga_ap_upgrader2: Refreshing state... [id=fsap-0a7e4164dbd4c5093][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-602106889][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1113637547][0m
[0m[1maws_lb.ga_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-issue-7-lb/2b2dbb892a420173][0m
[0m[1maws_route53_record.ga_record_cname["issue-7.ga-dev.bac-lac.ca"]: Refreshing state... [id=Z056957931UA8C0ZEYSRV__24d4fcb49a6e18bc2732d0320e66637e.issue-7.ga-dev.bac-lac.ca._CNAME][0m
[0m[1maws_acm_certificate_validation.ga_certificate_validation: Refreshing state... [id=2024-05-22 19:39:06.941 +0000 UTC][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-UZVOZ4O7HHD52URXRBVIZSQJH4][0m
[0m[1maws_route53_record.ga_record_a: Refreshing state... [id=Z056957931UA8C0ZEYSRV_issue-7.ga-dev.bac-lac.ca_A][0m
[0m[1maws_alb_listener.http_80: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-issue-7-lb/2b2dbb892a420173/8d010979c0888bd2][0m
[0m[1maws_alb_listener.ga_443: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-issue-7-lb/2b2dbb892a420173/e7966dbbc7ad6825][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_ecs_task_definition.ga_task_definition[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "ga_task_definition" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = jsonencode(
            [
              [32m+[0m[0m {
                  [32m+[0m[0m cpu              = 0
                  [32m+[0m[0m environment      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "CLUSTER_PORT"
                          [32m+[0m[0m value = "8006"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_PASSWORD"
                          [32m+[0m[0m value = "DB_PASSWORD"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_URL"
                          [32m+[0m[0m value = "DB_URL"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "DB_USERNAME"
                          [32m+[0m[0m value = "GADATA"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "MFT_CLUSTER"
                          [32m+[0m[0m value = "TRUE"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "SYSTEM_NAME"
                          [32m+[0m[0m value = "MFT-1"
                        },
                    ]
                  [32m+[0m[0m essential        = true
                  [32m+[0m[0m healthCheck      = {
                      [32m+[0m[0m command     = [
                          [32m+[0m[0m "CMD-SHELL",
                          [32m+[0m[0m "curl -f http://localhost:8000/ || exit 1",
                        ]
                      [32m+[0m[0m interval    = 30
                      [32m+[0m[0m retries     = 3
                      [32m+[0m[0m startPeriod = 120
                      [32m+[0m[0m timeout     = 5
                    }
                  [32m+[0m[0m image            = "helpsystems/goanywhere-mft"
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-create-group  = "true"
                          [32m+[0m[0m awslogs-group         = "/ecs/ga-td"
                          [32m+[0m[0m awslogs-region        = "ca-central-1"
                          [32m+[0m[0m awslogs-stream-prefix = "ecs"
                        }
                    }
                  [32m+[0m[0m mountPoints      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/userdata/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_userdata"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/sharedconfig/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_sharedconfig"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/upgrader/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_upgrader1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/config/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_config1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/etc/HelpSystems/GoAnywhere/tomcat/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_tomcatserver1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/tomcat/logs/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_tomcatlog1"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPath = "/opt/HelpSystems/GoAnywhere/ghttpsroot/custom/"
                          [32m+[0m[0m readOnly      = false
                          [32m+[0m[0m sourceVolume  = "ga_ap_ghttpsroot1"
                        },
                    ]
                  [32m+[0m[0m name             = "mft1"
                  [32m+[0m[0m portMappings     = [
                      [32m+[0m[0m {
                          [32m+[0m[0m appProtocol   = "http"
                          [32m+[0m[0m containerPort = 8000
                          [32m+[0m[0m name          = "mft1-8000-tcp"
                          [32m+[0m[0m protocol      = "tcp"
                        },
                    ]
                  [32m+[0m[0m systemControls   = []
                  [32m+[0m[0m volumesFrom      = []
                },
            ]
        )
      [32m+[0m[0m cpu                      = "1024"
      [32m+[0m[0m execution_role_arn       = (sensitive value)
      [32m+[0m[0m family                   = (sensitive value)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "3072"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags_all                 = (known after apply)
      [32m+[0m[0m track_latest             = false

      [32m+[0m[0m runtime_platform {
          [32m+[0m[0m cpu_architecture        = "X86_64"
          [32m+[0m[0m operating_system_family = "LINUX"
        }

      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_ghttpsroot1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-01a13ba86f96590e9"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_tomcatserver1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-0360c823309cf0470"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_sharedconfig"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-05292a8e4dfc4be54"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_tomcatlog1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-05a4c3a52bbdc9547"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_config1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-06070ee746705414f"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_upgrader1"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-08eab5d665ff72e45"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
      [32m+[0m[0m volume {
          [32m+[0m[0m name      = "ga_ap_userdata"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = "fs-0a150328d4a36cd79"
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 0

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = "fsap-0e00b128b22042290"
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*